results/results_r5_large/results_r5_large_run3/oltp_read_write_t32/sysbench.log
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 32
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 32 tps: 51.29 qps: 1055.10 (r/w/o: 742.06/62.59/250.45) lat (ms,95%): 1050.76 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 32 tps: 59.20 qps: 1189.65 (r/w/o: 834.13/68.40/287.11) lat (ms,95%): 877.61 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 32 tps: 56.10 qps: 1118.60 (r/w/o: 782.50/66.50/269.60) lat (ms,95%): 960.30 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 32 tps: 54.50 qps: 1096.30 (r/w/o: 767.90/66.20/262.20) lat (ms,95%): 1032.01 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 32 tps: 44.40 qps: 892.40 (r/w/o: 624.70/52.50/215.20) lat (ms,95%): 1280.93 err/s: 0.10 reconn/s: 0.00
[ 60s ] thds: 32 tps: 35.20 qps: 704.79 (r/w/o: 493.20/41.40/170.20) lat (ms,95%): 1506.29 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 32 tps: 44.40 qps: 881.11 (r/w/o: 617.10/53.50/210.50) lat (ms,95%): 1235.62 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 32 tps: 39.50 qps: 790.10 (r/w/o: 553.10/46.70/190.30) lat (ms,95%): 1506.29 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 32 tps: 46.90 qps: 928.80 (r/w/o: 649.10/56.80/222.90) lat (ms,95%): 1258.08 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 32 tps: 36.60 qps: 736.20 (r/w/o: 516.60/44.90/174.70) lat (ms,95%): 1479.41 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 32 tps: 44.00 qps: 886.59 (r/w/o: 621.39/53.10/212.10) lat (ms,95%): 1258.08 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 32 tps: 39.30 qps: 781.01 (r/w/o: 544.31/47.90/188.80) lat (ms,95%): 1327.91 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            77658
        write:                           6640
        other:                           26641
        total:                           110939
    transactions:                        5546   (45.89 per sec.)
    queries:                             110939 (917.93 per sec.)
    ignored errors:                      1      (0.01 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      45.8888
    time elapsed:                        120.8575s
    total number of events:              5546

Latency (ms):
         min:                                  244.28
         avg:                                  695.81
         max:                                 1941.90
         95th percentile:                     1235.62
         sum:                              3858985.57

Threads fairness:
    events (avg/stddev):           173.3125/2.63
    execution time (avg/stddev):   120.5933/0.21